// let arr = []
// Создать массив с четными элементами от 0 до 20
// for(let i=0; i<20; i+=2) {
//   arr.push(i)
// }
// Создать массив с элементами которые делятся на 3 без остатка от 30 до 0
// for(let i=30; i>0; i-=3) {
//   arr.push(i)
// }
// for(let i=30; i>0; i--) {
//   if(i%3==0) {
//     arr.push(i)
//   }
// }
// Создать массив элементы которого равны своим индексам в квадрате
// for(let i=0; i<10; i++) {
//   arr.push(Math.pow(i,2))
// }
//console.log(arr)

// Посчитать количество четных элементов массива
// let arr1 = [7,4,2,1,0,6,2,6,2,15,4,16]
// let count = 0;
// for(let item of arr1) {
//   if(item%2==0) {
//     count++;
//   }
// }
// for(let i=0; i<arr1.length; i++) {
//   if(arr1[i]%2==0) {
//     count++;
//   }
// }
// console.log("Всего четных элементов: " + count)